Revit 2024 API
RebarContainerItem.BaseFinishingTurns Property
 For a spiral, the number of finishing turns at the lower end of the spiral.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int BaseFinishingTurns { get; set; }
Visual Basic
Public Property BaseFinishingTurns As Integer
	Get
	Set
Visual C++
public:
property int BaseFinishingTurns {
	int get ();
	void set (int value);
}
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: turns must be between 0 and 100.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarContainerItem is not an instance of a spiral shape.
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace